---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.NoLoopsError
source: html/de8eb878-976d-289f-791f-9c60878cd529.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.NoLoopsError Property

Sketch is empty.

## Syntax (C#)
```csharp
public static FailureDefinitionId NoLoopsError { get; }
```